{"sections":{"main":{"type":"main-page","disabled":true,"settings":{}},"1634540899d6b913f1":{"type":"image-with-text","settings":{"image":"shopify:\/\/shop_images\/menubar.png","image_position":"right","image_width":20,"title":"Why do Vape Superstore need to verify your age?","title_bold":"light","content":"<p><br\/>It is illegal to sell electronic cigarettes and any vapour product that contain or can be used to deliver nicotine to all individuals under the age of 21. Therefore anyone placing an order with Vape Juice Depot must be over the age of 21. By making a purchase with VJD, you are agreeing to allow us to confirm your age with <a href=\"https:\/\/agechecker.net\/\" title=\"https:\/\/agechecker.net\/\">Age Checker<\/a><br\/><br\/><\/p>","button_text":"","button_link":""}},"1634540976d31081d5":{"type":"image-with-text","settings":{"image":"shopify:\/\/shop_images\/devices.png","image_position":"right","image_width":25,"title":"How do we verify your age?","title_bold":"light","content":"<p><br\/>When creating an account or placing an order with VJD we will request your full name, billing address and date of birth. This must be entered as it would appear on your drivers license, electoral roll or used for a US credit card. This information must be entered correctly as we will use it to verify your age before delivering any goods.<br\/><br\/>To securely verify your age Vape Juice Depot use Age Checker services to verify your age. Where you have asked us to provide an age restricted product or service, you consent to allow us to share your information with, and collect information from, Age Checker and third-party providers of identity data to Age Checker. This consent is necessary for Age Checker to verify that you meet the minimum age and identity verification requirements as determined by relevant US age restriction legislation.<br\/><br\/>You consent to allow Age Checker to retain relevant data for the purpose of future verification. All data processed by Age Checker is subject to appropriate security measures. Data retained by Age Checker is subject to periodic review to ensure it is not held for longer than necessary. You can find information about 1account and how they manage your personal data by visiting their website: <a href=\"https:\/\/agechecker.net\/\" title=\"https:\/\/agechecker.net\/\">Age Checker<\/a>.<br\/><br\/><\/p>","button_text":"","button_link":""}},"1635082662f27766ab":{"type":"image-list","blocks":{"1635082662f27766ab-0":{"type":"item","settings":{"image":"shopify:\/\/shop_images\/HOW-Screen-1.jpg","stretch_image":false,"background":"#ffffff","text_color":"#414141","image_list_title":"Open Popup","image_list_text":"Your teWhen a customer is ready to place their order, the AgeChecker.Net popup will appear and explain the verification process and why it is required. Our service works on a variety of devices and platforms making the process smooth on both desktop and mobile, and usually takes under a minute to complete.xt","image_list_second_text":""}},"cc2e3054-912a-4c9e-afca-1b023a4b5224":{"type":"item","settings":{"image":"shopify:\/\/shop_images\/HOW-Screen-2.jpg","stretch_image":false,"background":"#ffffff","text_color":"#414141","image_list_title":"Enter Information","image_list_text":"Next, the customer is asked for their date of birth and their personal information if we don't already know it. For most websites, we can automatically pull the customer's name and address from your checkout page so they don't have to enter it again. We disable some of the checkout fields on your website to prevent the customer from changing their name or address after being verified with a different identity.","image_list_second_text":""}},"44222021-9d34-4115-819c-110de7a39b7f":{"type":"item","settings":{"image":"shopify:\/\/shop_images\/HOW-Screen-3.jpg","stretch_image":false,"background":"#ffffff","text_color":"#414141","image_list_title":"Verify Information","image_list_text":"The information submitted by the customer is processed by our service and checked against millions of documents consisting of public records, credit information, and other sources. For over 90% of the US population, we can automatically approve them with just this information. For international orders, we verify the customer is outside of the US and then allow them to continue. If we determine that the information submitted is fraudulent or it was not found in our databases, we will ask the customer to submit a photo ID.","image_list_second_text":""}},"9ce896f8-c188-4b7e-be38-f2e46a3d58f1":{"type":"item","settings":{"image":"shopify:\/\/shop_images\/HOW-Screen-4.jpg","stretch_image":true,"background":"#ffffff","text_color":"#414141","image_list_title":"Upload ID (if required)","image_list_text":"If we request a photo ID, we will give the customer a few options to upload a picture of their ID with their name and date of birth clearly visible. A picture can be taken directly from our popup if the user has a webcam and a supported browser, or they can upload a picture from a file. If they are on a mobile device, they are directed to their camera app to take a picture. Customers using a computer can also request a link to be sent to their phone, allowing them to take a picture with their phone and then continue the process on their computer. Once a picture is submitted, we will verify it in around 10 to 20 seconds.","image_list_second_text":""}},"b2916ec0-c024-459c-95ef-aa7e65bc5bae":{"type":"item","settings":{"image":"shopify:\/\/shop_images\/HOW-Screen-5.jpg","stretch_image":true,"background":"#ffffff","text_color":"#414141","image_list_title":"Complete Purchase","image_list_text":"Once a user is verified, they can complete their purchase with one more click. If they submitted a photo ID, we will remember them so they never have to submit a photo ID again. If the customer was not verified successfully, we give them a chance to fix their picture and try again if it was blurry or unreadable. If we determine that they are underage, we can disable their access to our service. The process is seamless for all users, and takes under a minute from start to finish in most cases. Remember that most customers will never even have to upload an ID.","image_list_second_text":""}}},"block_order":["1635082662f27766ab-0","cc2e3054-912a-4c9e-afca-1b023a4b5224","44222021-9d34-4115-819c-110de7a39b7f","9ce896f8-c188-4b7e-be38-f2e46a3d58f1","b2916ec0-c024-459c-95ef-aa7e65bc5bae"],"settings":{"expand_items":true,"section_size":"large","stack_mobile":true,"title":"How it works"}},"1635153159ac33504f":{"type":"loyalty-faq","blocks":{"1635153159ac33504f-0":{"type":"separator","settings":{"title":"Verification FAQ"}},"1635153159ac33504f-1":{"type":"question","settings":{"title":"What is AgeChecker.Net?","answer":"<p>AgeChecker.Net is an age verification technology used by online stores that sell age-restricted products such as electronic cigarettes, tobacco, alcohol, etc. Age verification is required by many federal and state laws. Our job is to provide websites with legally accepted records showing that their sales have been age verified. We do so in a way that is as unobtrusive to you, the customer, as possible.<\/p>"}},"1635153159ac33504f-2":{"type":"question","settings":{"title":"What information is required?","answer":"<p>For most customers, we only require name, date of birth, and address. If we cannot verify your age automatically, we will prompt you to submit an image of your government-issued photo ID - the same one you would present in a retail store to buy the same product. Please note that our software is often able to retrieve your name and address automatically from your payment or shipping credentials. In this case, you will only have to input your date of birth manually.<\/p>"}},"1635153159ac33504f-3":{"type":"question","settings":{"title":"How do I upload my photo ID?","answer":"<p>Take a picture using your webcam directly from our popup.Upload an image saved on any device.Enter your mobile phone number and we'll text you a link to complete the process on your phone.<\/p>"}},"1635153159ac33504f-5":{"type":"question","settings":{"title":"What kinds of photo IDs do you accept?","answer":"<p>If you are prompted to submit a photo ID to complete the age verification process, we will accept a government-issued ID such as a driver's license, state identification card, military ID, or passport. Your name, date of birth, and the expiration date must be visible, and name on the ID must match the name on the rest of your order information. The date of birth you enter into our popup must also match the ID, even if both are above the minimum age. Accurate records will allow you to pass the ID prompt next time. Certain IDs, such as military IDs, require images of the front and back to show us the necessary information. If you are having trouble uploading two images in one submission through our popup, please email them as attachments to help@agechecker.net and we will manually verify your order. Since we delete ID submissions automatically, two separate submissions cannot be verified.<\/p>"}},"1635153159ac33504f-6":{"type":"question","settings":{"title":"How is my information secured?","answer":"<p>The information you provide is used solely to verify your age. We never share or sell data to third-parties. Your privacy and security are important to us. Access to all of our services is protected with strong 256-bit AES encryption. All personal information is stored on a private internal network that is not connected to the internet. We will securely store your date of birth, name, and address so that we can verify you without photo ID if you order again. Photo IDs are not stored; they are deleted as soon as you are verified. For more information, see our privacy policy.<\/p>"}},"1635153159ac33504f-8":{"type":"question","settings":{"title":"How long does it take to be verified?","answer":"<p>We can verify about 90% of U.S. customers instantly using just their name, address, and date of birth. If you cannot be verified automatically using basic order information, you will be prompted to submit an image of your photo ID. This process is easy and occurs within our popup; you will not be redirected from the checkout page. Once you have submitted a photo ID, it usually takes 10 to 30 seconds to verify you, depending on the number of requests in our queue.<\/p>"}}},"block_order":["1635153159ac33504f-0","1635153159ac33504f-1","1635153159ac33504f-2","1635153159ac33504f-3","1635153159ac33504f-5","1635153159ac33504f-6","1635153159ac33504f-8"],"settings":{"show_contact_info":false,"contact_info_heading":"Any question?","contact_info_text":"<p>If we still haven't answered your question, you can contact us below and we will get back to you as soon as possible.<\/p>","contact_1_icon":"bi-phone","contact_1_heading":"Customer support","contact_1_text":"<p>Enter your text here<\/p>","contact_2_icon":"bi-email","contact_2_heading":"Send a message","contact_2_text":"<p>Enter your text here<\/p>"}},"1635160030e98b4001":{"type":"collapsible-tabs","settings":{"show_tabs":true}}},"order":["main","1634540899d6b913f1","1634540976d31081d5","1635082662f27766ab","1635153159ac33504f","1635160030e98b4001"]}